#키오스크에서 메뉴를 선택하면 영수증이 출력되는 프로그램을 실행해보자
#사용자에게 메뉴를 먼저 보여주고 번호를 고르도록 하여라.
#메뉴는 다섯가지 알아서 정하시오(예: 아메리카노, 카페라떼)










































print('1.(3.5)\n2.에스프레소(2.5)\n3.아메리카노(3.0)\n4.곡물라떼(4.0)\n5.밀크티(4.3)')
choose_menu = int(input("메뉴선택 번호를 입력해주세요: "))
if choose_menu == 1:
    print('-------------------------------')
    print('메뉴 : 카페라떼\n가격 : 3,500원')
    print('-------------------------------')
elif choose_menu == 2:
    print('-------------------------------')
    print('메뉴 : 에스프레소\n가격 : 2,500원')
    print('-------------------------------')
elif choose_menu == 3:
    print('-------------------------------')
    print('메뉴 : 아메리카노\n가격 : 3,000원')
    print('-------------------------------')
elif choose_menu == 4:
    print('-------------------------------')
    print('메뉴 : 곡물라떼\n가격 : 4,000원')
    print('-------------------------------')
elif choose_menu == 5:
    print('-------------------------------')
    print('메뉴 : 밀크티\n가격 : 4,300원')
    print('-------------------------------')
