1. 데이터와 그래프

변수 : 조사 목적에 따라 관측된 자료값, 해당 변수에 대하여 관측된 값들이 바로 자료(data)가 됨

질적자료 : 관측된 데이터가 범주로 구분하여 표현할 수 있는 데이터
    -명목형 변수 : 변수나 크기가 순서에 대한 의미가 없고 이름만 의미를 부여 가능 . ex) 성별, 지역, 종교 등
    -순서형 변수 : 변수가 어떤 기준에 따라 순서에 의미를 부여할 수 있음 . ex) 올림픽순위, 만족도 등

양적자료 : 관측된 데이터가 숫자의 형태로 숫자의 크기가 의미를 갖고 있음
    -이산형 변수 : 변수가 취할 수 있는 값을 하나하나 셀 수 있는 경우 . ex) 정수처럼 1,2,3으로 셀 수있는거. 집안의 방 개수, 퀴즈 맞춘 개수 등
    -연석형 변수 : 변수가 구간 안의 모든 값을 가질 수 있는 경우 . ex)실수처럼 키, 몸무게 등


- 데이터를 분석하는 과정 중에 가장 많이 사용하는 분석 방법을 "EDA"라고 하고
  EDA는 도표, 그래프,요약 통계 등을 사용하여 데이터를 체계적으로 분석하는 하나의 방법임

- 데이터 시각화는 데이터 분석 결과를 쉽게 이해할 수 있도록 시각적으로 전달되는 과정을 말한다.
    ex)도수분포표, 파이차트, 히스토그램, 막대그래프 등

2. 데이터의 기초 통계량

기초통계량 : 통계량은 표본으로 산출한 값, 기술 통계량이라고도 표현함

중심 경향치 : 표본의 중심을 설명하는 값을 대표값이라 하며 이를 중심경향치라고 함

- 중앙값 : 관측치를 크기순으로 나열 했을 때, 가운데 위치하는 값

- 최빈값 : 관측치 중에 가장 많이 관측되는 값

- 산포도 : 자료가 흩어져 있는 정도를 하나의 수로 나타낸 값

- 범위 : 데이터의 최대값과 최소값의 차이를 의미

- 사분위수 : 전체 데이터를 오름차순으로 정렬하여 4등분을 했을때 첫 번째 제1사분위수, 두 번째를 제2사분위수, 세 번째를 제3사분위수라고 함

- 분산 : 데이터의 분포가 얼마나 흩어져 있는지를 알 수 있는 측도(분산이 크면 분포가 넓어지고 분산이 작으면 분포가 좁아짐)

- 표준편차 : 분산의 제곱근

- 변동계수 : 평균이 다른 두개 이상의 그룹의 표준편차를 비교할 때 사용함

- 왜도 : 자료의 분포가 얼마나 비대칭적인지 표현하는 지표

- 첨도 : 확률분포의 꼬리가 두꺼운 정도를 나타내는 척도

